{
  "backend/main.mo": "Defines actor with restaurant, booking, and reel management plus initialization, queries, and booking creation.",
  "backend/migration.mo": "Migration module copying old actor data structures to new formats without transformation.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and tests.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend components and configuration files.",
  "frontend/.gitignore": "Git ignore rules for dependencies, environment files, build outputs, Android artifacts, and export zips.",
  "frontend/ANDROID_APK.md": "Guide explaining prerequisites and steps to build the Android debug APK for the web app.",
  "frontend/android/app/build.gradle": "Android app module Gradle config defining SDK versions, build types, and dependencies.",
  "frontend/android/app/src/main/AndroidManifest.xml": "App manifest defining permissions, app metadata, and MainActivity launcher configuration.",
  "frontend/android/app/src/main/java/com/tablebook/webview/MainActivity.kt": "Android activity hosting a WebView that loads bundled web assets with basic navigation handling.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon referencing same background and foreground assets.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon XML referencing background and foreground assets.",
  "frontend/android/app/src/main/res/values/colors.xml": "Defines the launcher background color.",
  "frontend/android/app/src/main/res/values/strings.xml": "Defines the app name string resource.",
  "frontend/android/app/src/main/res/values/themes.xml": "Defines the TableBook app theme with primary colors and light status bar.",
  "frontend/android/build.gradle": "Top‑level Gradle build file setting Kotlin version and Android plugin configuration.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Gradle wrapper settings specifying Gradle distribution and storage paths.",
  "frontend/android/gradlew": "POSIX Gradle wrapper script for executing Gradle builds.",
  "frontend/android/gradlew.bat": "Windows batch script to locate Java and launch the Gradle wrapper.",
  "frontend/android/settings.gradle": "Configures plugin and dependency repositories and sets the root project name and modules.",
  "frontend/EXPORT_SOURCE_ZIP.md": "Instructions for exporting the full project source code as a ZIP archive.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles.",
  "frontend/index.html": "Base HTML entry file loading the React app and supporting WebView asset paths.",
  "frontend/scripts/android-sync-web-assets.sh": "Syncs built frontend web assets into the Android app's assets directory.",
  "frontend/scripts/export-source-zip.sh": "Creates a ZIP archive of the project source while excluding build artifacts.",
  "frontend/src/App.tsx": "Main React app managing tabs, views, offer ad display, and restaurant navigation.",
  "frontend/src/components/BookingForm.tsx": "Form component for submitting table booking details with validation.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar for switching between home and reels tabs.",
  "frontend/src/components/LaunchOfferAd.tsx": "Full‑screen promotional launch offer modal with close and branding elements.",
  "frontend/src/components/MenuList.tsx": "Displays a list of menu items with names, descriptions, and prices.",
  "frontend/src/components/ReelPlayer.tsx": "Video reel player with play, pause, mute controls, and overlay UI.",
  "frontend/src/components/RestaurantCard.tsx": "Clickable card component displaying a restaurant’s name, description, and address with icons and styling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication, identity loading, login flow, and related state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching restaurants, restaurant details, reels, and creating bookings through the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining theme variables and global styles for light and dark modes.",
  "frontend/src/main.tsx": "App entry point wiring React Query and Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/HomeTab.tsx": "Page displaying restaurant list with loading, error, and empty states using RestaurantCard components.",
  "frontend/src/pages/ReelsTab.tsx": "Page that loads and displays restaurant reels with loading, error, and empty handling.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Restaurant detail page showing info, menu, and booking form with booking submission logic and UI states.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "JSON describing the app’s current state, including features for navigation, launch ad, restaurant listings, detail views, booking, reels, theming, and static assets. It also records schema version, project version, notes, and requirement mappings."
}